Revit 2027 API
TextElement.Text Property
 The content of the element as a plain string stripped of all formating.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
public:
property String^ Text {
	String^ get ();
	void set (String^ value);
}
member Text : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
If a new text content is set, all previous formating that might have been set on parts of the original text will be lost. After setting the new text, only the formating parameters of the associated text type will be applied.
The value of this property can also be accessed via the TEXT_TEXT Built-In parameter.
See Also
Reference
TextElement Class
Autodesk.Revit.DB Namespace